{
    "home":{
        "title": "반갑습니다!",
        "click": "계속 둘러보기",
        "lang": ["언어를", "선택해주세요!"],
        "comment": ["안녕", "을 utf8로 인코딩 후 이진수로 바꿔 시각화해보았습니다"]
    },
    "profile":{
        "skip": "클릭하여 다음 페이지로 이동",
        "intro": {
            "0": "안녕하세요 👋 ",
            "1": "저는 세상이 필요로 하는 서비스의 “가치”를 고민하며 나만의 발자취를 남기고자 합니다.",
            "2": "강한 성장욕구와 함께 더 나은 내일의 나로 성장하기 위해 1일 1커밋을 지키고 있습니다.",
            "3": "수많은 개발 동아리, 그룹 활동, 멘토링 활동을 통해 팀플레이어로써 세상의 큰 문제를 풀어갈 준비가 되어있습니다.",
            "4": "새기술을 빨리 체득하고 단기간/최대효율을 낼 수 있습니다"
        },
        "terminal": "← 저를 더 알아보고 싶으시다면 다음 버튼을 눌러주세요 ↓",
        "experience": [],
        "education": []
    },
    "portfolio":{
        "myStory": "저는 한 나라의 언어를 할 줄 앎은 의사소통 수단을 넘어 더 넓은 커넥션과 기회를 뜻한다고 믿습니다. \n 저는 21살까지 베트남 국제학교에서 경제경영 공부를 하였고, 학부공부 이외에도 하루 최소 4시간씩의 언어 공부를 병행하여 하노이 사범대학교에서 베트남어로 무역수업을 들으며 베트남어 능력 검정 시험 (고급) &  국제통·번역협회에서 ITT 비즈니스 영어통번역 자격증을 취득하여 및 꾸준한 통·역번역 활동에 참여하였습니다.\n 개발자로 전향하게 된 계기는 아주 단순했습니다. 약 2년 전 EO라는 이름의 유튜브 채널에서 다른 실리콘 밸리 엔지니어 인터뷰에서 “개발자”의 성장력과 세상에 내 가치를 쉽게 전달할 수 있는 도구라는 잠재력에, 정해진 틀에 갇혀 있지 않고, 세상이 해결해야 할 문제를 자신의 도전과제로 여긴다는 매력에 빠지게 되었습니다. 이후 호주 학교로 편입 후 정보시스템학과를 공부하며 IT 기술을 활용한 전략적인 비즈니스 프로세스 관리 접근법과 함께 컴퓨터 공학 기초 및 프로그래밍을 공부하였고 학부 내 상위 1%의 성적으로 졸업할 수 있었습니다.\n 저는 문제를 고민하고 해결하는 모든 과정을 즐기고, 그 원동력으로 다양한 개발 분야를 접해보았습니다. 그 중에서도 특히 관심 있는 분야는 백엔드 개발/ 풀스택 개발입니다. \n어제보다 더 나은 오늘의 나를 목표로 살아갑니다. 헝그리 정신과 함께 목표한 바는 어떤 수단을 동원해서라도, 부족하면 어떻게든 배워서 이뤄냅니다. 첫 웹 쇼핑몰 개발 프로젝트 또한 Django를 공부하며 배운 내용을 바로바로 적용해가며 주6일 3개월간 매일 9-12시간씩 작업하며 완성했고, 인턴 활동 중 자연어 처리 모델을 만들면서, 또 여러 풀스택 사이드 프로젝트를 진행하며 필요한 패키지들을 빠른 시간 내 학습하여 정확도 향상과 함꼐 좋은 결과물을 만들어내었습니다. \n비전공자로써 개발 공부를 하다 보면 컴퓨터 공학 지식이 필요한 순간이 찾아오고, 그때 비전공자를 위한 이해할 수 있는 IT 지식, Clean code (공부 중), 패스트캠퍼스 컴퓨터 공학 전공 필수 강의를 바로 공부하며 부족한 지식을 채워갔습니다. 더 성장하고 싶은 욕구와 성실함이 합쳐 어려운 새로운 기술을 빨리 배울 수 있고 또 적용할 수 있다고 믿습니다. ",
        "pvSkill": "작년 하반기 차별적인 키토크 추천 기술로 유저의 검색 경험을 높여주는 마이셀럽즈에서 3개월여간 데이터 인턴 활동을 하며 천만 건 이상의 데이터 수집 및 자동 판단 모델을 생성한 경험이 있습니다. 기존까지는 동일한 화장품 A==A’를 동일시 판단하는 과정은 반복적으로 진행되어왔고 많은 인력과 시간이 소요되었습니다. 이 과정을 자동화하기 위하여 콘텐츠 제작자 혹은 목적성(판매용/기술용)에 따라 다르게 표현되는 화장품 타이틀의 불용어를 패턴화하고 전처리하는 알고리즘과 Mecab, TF-idf 활용 모델링, 화장품 각도 혹은 세트 상품을 스스로 판별할 수 있는 이미지 모델을 생성하였습니다. 단 3명의 팀이 충분치 않은 자원으로 수백만 건의 데이터를 수집부터 모델링까지 3개월 안에 마무리 짓는 일은 거의 불가능에 가까웠다고 생각합니다. 엄청나게 많은 업무를 최단 시간 안에 끝내야 하는 스타트업 특성상, 오후 10시 퇴근 (건물 클로징 타임), 퇴근 후 및 연휴 근무도 마다하지 않고 맡은 업무를 끝까지 온 힘을 다해 마무리 지었습니다. 데이터를 수집하는 과정에서도 피치 못한 문제들로 유실을 피할 수는 없었고, 유실이 발생할 수 있는 수십 가지의 경우의 수를 생각하며 재사용성이 높은 코드를 고민하는 과정에서 객체지향프로그래밍의 다형성, 객체, 캡슐화 원칙을 학습할 수 있었습니다. 너무나도 다양한 패턴으로 묘사되는 화장품을 텍스트만으로 동일한 제품으로 그루핑함에 있어 큰 어려움을 겪었고, 이를 해결하기 위하여 불용어 패턴을 적립 및 반복적으로 출현하는 불용어 리스트를 추출하여 정규표현식을 표현해 삭제, 비교 대상군을 브랜드 단위로 줄여 제품 매칭률을 높이는 방법 등 각각의 예외 케이스를 해결할 수 있는 다양한 접근법을 메뉴얼화하여 전처리를 통해 모델 정확도를 약 5% 향상시키는 결과를 낼 수 있었습니다.  "
    }
}